export const elements = ["жена", "группа", "развитие", "процесс", "суд", "условие", "средство", "начало", "свет", "пора", "путь", "душа", "уровень", "форма", "связь", "минута", "улица", "вечер", "качество", "мысль", "дорога", "мать", "действие", "месяц", "государство", "язык", "любовь", "взгляд", "мама", "век", "школа", "цель", "общество", "деятельнось", "организация", "президент", "комната", "страна", "мир", "случай", "голова", "ребенок", "сила", "конец", "вид", "система", "часть", "город", "отношение", "женщина", "деньги", "земля", "машина", "вода", "отец", "проблема", "час", "право", "нога", "решение", "дверь", "образ", "история", "власть", "закон", "война", "бог", "голос", "тысяча", "книга", "возможность", "результат", "ночь", "стол", "имя", "область", "статья", "число", "компания", "народ", "Человек", "год", "время", "дело", "жизнь", "день", "рука", "раз", "работа", "слово", "место", "лицо", "друг", "глаз", "вопрос", "дом", "сторона"]


export function shuffleArray(arr: Array<string>) {
    const array = [...arr]
    for (let i = array.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array
}

export function filterByCountOfSymbols(array: Array<string>, num: number) {
    return array.filter(word => word.length === num)
}

export function cutOffExcess(array: Array<string>, num: number) {
    return array.length > num ? array.slice(num+1) : array
}